In [32]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from datetime import date
import sqlite3

### Q1. Import all 4 datasets provided in the previous question.

In [95]:
Table_a = pd.read_csv("TableA.csv")
Table_b = pd.read_csv("TableB.csv")
Table_c = pd.read_csv("TableC.csv")
Table_d = pd.read_excel("TableD.xlsx")

After checking all the columns for null value. We come to know discount column has null value. Hence replacing it with 0

In [96]:
Table_a['discount'].isnull().values.any()

True

In [101]:
Table_b['discount'].isnull().values.any()

True

In [102]:
Table_c['discount'].isnull().values.any()

True

In [98]:
# Resolving null values for table A
Table_a["discount"].fillna(0,inplace=True)
Table_a['discount'].isnull().values.any()

False

In [105]:
# Resolving null values for table B
Table_b["discount"].fillna(0,inplace=True)
Table_b['discount'].isnull().values.any()

False

In [106]:
# Resolving null values for table C
Table_c["discount"].fillna(0,inplace=True)
Table_c['discount'].isnull().values.any()

False

In [107]:
Table_b.head()

,booking_id,customer_id,source,status,checkin,checkout,rooms,hotel_id,amount,discount,date
0,1001,32661,4,2,2/19/2017,2/20/2017,1,252,2506,530.0,2/19/2017
1,1002,77901,1,2,2/17/2017,2/18/2017,1,252,2573,545.0,2/14/2017
2,1003,36635,4,2,2/16/2017,2/17/2017,1,252,2616,553.0,2/15/2017
3,1004,36635,4,2,2/14/2017,2/16/2017,1,252,5478,1159.0,02-11-2017
4,1005,193104,4,2,02-12-2017,2/14/2017,1,252,5502,1164.0,02-12-2017

In [108]:
Table_c.head()

,booking_id,customer_id,source,status,checkin,checkout,rooms,hotel_id,amount,discount,date
0,2001,189314,4,3,04-02-2017,04-03-2017,1,252,3215,680.0,3/26/2017
1,2002,77901,4,2,04-01-2017,04-02-2017,1,252,2675,567.0,3/31/2017
2,2003,199763,4,3,3/24/2017,3/25/2017,1,252,2652,561.0,3/24/2017
3,2004,162631,0,2,3/21/2017,3/22/2017,1,252,3366,740.0,3/20/2017
4,2005,119697,2,2,3/17/2017,3/18/2017,2,252,6399,1354.0,3/17/2017

In [109]:
Table_d.head()

   hotel_id     city
0         3  Gurgaon
1        13  Gurgaon
2        16  Gurgaon
3        21  Gurgaon
4        25    Delhi

### Q2. Extract unique users for each month and calculate total number of bookings made by each, total amount spent in each month, total room nights stayed (status2) for each user for each month.

In [110]:
Table_a.head()

,booking_id,customer_id,source,status,checkin,checkout,rooms,hotel_id,amount,discount,date
0,1,189314,4,3,02-04-2017,02-05-2017,1,252,3160,669.0,1/31/2017
1,2,46268,4,3,1/27/2017,1/28/2017,1,252,1893,481.0,1/27/2017
2,3,55271,3,2,1/25/2017,1/26/2017,1,252,2188,463.0,1/25/2017
3,4,170766,4,3,1/26/2017,1/27/2017,1,252,3054,646.0,1/26/2017
4,5,170766,4,3,1/26/2017,1/28/2017,1,252,6107,1293.0,1/25/2017

In [113]:
conn = sqlite3.connect("valiance.db")
Table_a.to_sql(name="TableA", con=conn)
Table_b.to_sql(name="TableB", con=conn)
Table_c.to_sql(name="TableC", con=conn)
Table_d.to_sql(name="TableD", con=conn)

In [176]:
# Answer 1 : Month Jan
Aa = pd.read_sql("select customer_id, count(customer_id) as num_booking_jan, sum(amount-discount) as total_amount_spent_jan from TableA group by customer_id", conn)
Ab = pd.read_sql("select customer_id, rooms*count(status) as total_room_nights_jan from TableA where status=2 group by customer_id", conn)
Month_A = pd.merge(Aa,Ab[['customer_id','total_room_nights_jan']], on='customer_id')
Month_A.head()

   customer_id  num_booking_jan  total_amount_spent_jan  total_room_nights_jan
0          220                2                  2714.0                      1
1          765                1                  1371.0                      1
2         1864                2                  3381.0                      2
3         2162                1                  3103.0                      1
4         2202                2                 15918.0                      2

In [178]:
# Answer 1 : Month Feb
Ba = pd.read_sql("select customer_id, count(customer_id) as num_booking_feb, sum(amount-discount) as total_amount_spent_feb from TableA group by customer_id", conn)
Bb = pd.read_sql("select customer_id, rooms*count(status) as total_room_nights_feb from TableA where status=2 group by customer_id", conn)
Month_B = pd.merge(Ba,Bb[['customer_id','total_room_nights_feb']], on='customer_id')
Month_B.head()

   customer_id  num_booking_feb  total_amount_spent_feb  total_room_nights_feb
0          220                2                  2714.0                      1
1          765                1                  1371.0                      1
2         1864                2                  3381.0                      2
3         2162                1                  3103.0                      1
4         2202                2                 15918.0                      2

In [179]:
# Answer 1 : Month Jan
Ca = pd.read_sql("select customer_id, count(customer_id) as num_booking_mar, sum(amount-discount) as total_amount_spent_mar from TableA group by customer_id", conn)
Cb = pd.read_sql("select customer_id, rooms*count(status) as total_room_nights_mar from TableA where status=2 group by customer_id", conn)
Month_C = pd.merge(Ca,Cb[['customer_id','total_room_nights_mar']], on='customer_id')
Month_C.head()

   customer_id  num_booking_mar  total_amount_spent_mar  total_room_nights_mar
0          220                2                  2714.0                      1
1          765                1                  1371.0                      1
2         1864                2                  3381.0                      2
3         2162                1                  3103.0                      1
4         2202                2                 15918.0                      2

### Q3. Merge these summarized datasets to create one dataframe such that you can see all these summarized columns for each month side by side. Below is an example of the output:

In [182]:
Sum1 = pd.merge(Month_A, Month_B[['customer_id','num_booking_feb','total_amount_spent_feb','total_room_nights_feb']], on='customer_id')
Summmary = pd.merge(Sum1, Month_C[['customer_id','num_booking_mar', 'total_amount_spent_mar','total_room_nights_mar']], on='customer_id')
Summmary.head()

,customer_id,num_booking_jan,total_amount_spent_jan,total_room_nights_jan,num_booking_feb,total_amount_spent_feb,total_room_nights_feb,num_booking_mar,total_amount_spent_mar,total_room_nights_mar
0,220,2,2714.0,1,2,2714.0,1,2,2714.0,1
1,765,1,1371.0,1,1,1371.0,1,1,1371.0,1
2,1864,2,3381.0,2,2,3381.0,2,2,3381.0,2
3,2162,1,3103.0,1,1,3103.0,1,1,3103.0,1
4,2202,2,15918.0,2,2,15918.0,2,2,15918.0,2

### Calculate Repeat Rate for the month February (If X customers had made the bookings in the month of Jan 2017 (TableA), how many of them made them in Feb 2017 too. (TableB) too i.e Y) - (Y/X*100)

In [205]:
X = pd.read_sql("Select count(distinct(customer_id)) as X from TableA", conn)
Y = pd.read_sql("Select count(distinct(TableB.customer_id)) as Y from TableB LEFT JOIN TableA ON TableA.customer_id = TableB.customer_id", conn)
repeat_rate = Y['Y'][0]/X['X'][0]*100

In [206]:
repeat_rate

97.2183588317107

### Q5. For each city, give the top 3 revenue earning hotels over this time period. (Not separately for Jan, Feb, Mar)

In [245]:
Table_a.shape

(1000, 11)

Concatinating all three month data

In [247]:
a = pd.concat([Table_a,Table_b,Table_c])

In [248]:
a.shape

(2889, 11)

In [251]:
df_A = pd.merge(a, Table_d[['hotel_id','city']], on='hotel_id')
df_A.head()
df_A = df_A.drop(['booking_id','customer_id','source','status','checkin','checkout','rooms','date'],1)
df_A['revenue_earned'] = df_A['amount']-df_A['discount']
df_A = df_A.drop(['amount','discount'],1)
# Pushing data into database
df_A.to_sql(name="Three_month", con=conn)

In [258]:
distinct_cities = pd.read_sql("select distinct(city) from Three_month",conn)
for i in distinct_cities['city']:
    print(pd.read_sql("select city, hotel_id from Three_month where city='"+i+"' order by revenue_earned desc limit 3", conn))

        city  hotel_id
0  Bangalore       106
1  Bangalore       409
2  Bangalore       597
      city  hotel_id
0  Chennai       691
1  Chennai       978
2  Chennai       691
    city  hotel_id
0  Delhi       309
1  Delhi       378
2  Delhi       233
      city  hotel_id
0  Gurgaon         3
1  Gurgaon       346
2  Gurgaon       346
        city  hotel_id
0  Hyderabad       979
1  Hyderabad       703
2  Hyderabad       666
     city  hotel_id
0  Jaipur       724
1  Jaipur       140
2  Jaipur       450
      city  hotel_id
0  Kolkata       956
1  Kolkata       926
2  Kolkata       306
     city  hotel_id
0  Mumbai       534
1  Mumbai       885
2  Mumbai       538
    city  hotel_id
0  Noida       777
1  Noida       261
2  Noida       772
   city  hotel_id
0  Pune       594
1  Pune       663
2  Pune       411

# Done